Unit 06 텍스트 다루기

6.1 대소문자 변환과 공백

In [213]:
import pandas as pd

In [214]:
file = '../DATA/chicago_food_inspections.csv'

In [215]:
chicagoDF = pd.read_csv(file)

In [216]:
chicagoDF

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

In [217]:
chicagoDF['Name'].head().values #공백이 있음.

array([' MARRIOT MARQUIS CHICAGO   ', ' JETS PIZZA ', '   ROOM 1520 ',
       '  MARRIOT MARQUIS CHICAGO  ', ' CHARTWELLS   '], dtype=object)

In [218]:
chicagoDF['Name'].str #공백을 처리하기 위해 str로 변경.

In [219]:
dessert = '  cheesecake   '
dessert.lstrip()

'cheesecake   '

In [220]:
dessert.rstrip()

'  cheesecake'

In [221]:
dessert.strip()

'cheesecake'

In [222]:
chicagoDF['Name'].str.lstrip().head()

0    MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3     MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [223]:
chicagoDF['Name'].str.rstrip().head()

0      MARRIOT MARQUIS CHICAGO
1                   JETS PIZZA
2                    ROOM 1520
3      MARRIOT MARQUIS CHICAGO
4                   CHARTWELLS
Name: Name, dtype: object

In [224]:
chicagoDF['Name'].str.strip().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [225]:
chicagoDF['Name']=chicagoDF['Name'].str.strip()

In [226]:
chicagoDF.columns

Index(['Name', 'Risk'], dtype='object')

In [227]:
for column in chicagoDF.columns :
    chicagoDF[column] = chicagoDF[column].str.strip() #공백삭제 For문

In [228]:
chicagoDF['Name'].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [229]:
steak = pd.Series(['porterhouse', 'filet mignon', 'ribeye'])

In [230]:
steak.str.upper()

0     PORTERHOUSE
1    FILET MIGNON
2          RIBEYE
dtype: object

In [231]:
chicagoDF['Name'].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [232]:
chicagoDF['Name'].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

6.2 문자열 슬라이싱

In [233]:
chicagoDF['Risk'].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: object

In [234]:
len(chicagoDF) #데이터셋의 길이

153810

In [235]:
chicagoDF['Risk'].unique() # 고유값의 종류 반환.

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
      dtype=object)

In [236]:
chicagoDF = chicagoDF.dropna(subset=['Risk']) # Risk 열에 있는 결측값 삭제.

In [237]:
chicagoDF

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153744 rows x 2 columns]

In [238]:
chicagoDF['Risk'].unique()

array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All'],
      dtype=object)

6.3 문자열 슬라이싱과 문자 치환

In [239]:
chicagoDF['Risk'].str.slice(5,6).head() #인덱스 5과 6사이에 있는 것 출력.|

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [240]:
chicagoDF['Risk'].str[5:6].head() #리스크 번호 출력.

0    1
1    2
2    3
3    1
4    1
Name: Risk, dtype: object

In [241]:
chicagoDF['Risk'].str.slice(8).head()
chicagoDF['Risk'].str[8:].head()

0      High)
1    Medium)
2       Low)
3      High)
4      High)
Name: Risk, dtype: object

In [242]:
chicagoDF['Risk'].str.slice(8, -1).head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [243]:
chicagoDF['Risk'].str[8:-1].head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

In [244]:
chicagoDF['Risk'].str.slice(8).str.replace(")", "").head()

0      High
1    Medium
2       Low
3      High
4      High
Name: Risk, dtype: object

6.4 불리언 메소드

In [245]:
'Pizza' in 'Jets Pizza'

True

In [246]:
'pizza' in 'Jets Pizza'

False

In [247]:
chicagoDF['Name'].str.lower().str.contains('pizza').head()

0    False
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [248]:
hasPizza = chicagoDF['Name'].str.lower().str.contains('pizza')

In [249]:
chicagoDF[hasPizza]

                                    Name             Risk
1                             JETS PIZZA  Risk 2 (Medium)
19         NANCY'S HOME OF STUFFED PIZZA    Risk 1 (High)
27            NARY'S GRILL & PIZZA ,INC.    Risk 1 (High)
29                   NARYS GRILL & PIZZA    Risk 1 (High)
68                         COLUTAS PIZZA    Risk 1 (High)
...                                  ...              ...
153756       ANGELO'S STUFFED PIZZA CORP    Risk 1 (High)
153764                COCHIAROS PIZZA #2    Risk 1 (High)
153772  FERNANDO'S MEXICAN GRILL & PIZZA    Risk 1 (High)
153788            REGGIO'S PIZZA EXPRESS    Risk 1 (High)
153801        State Street Pizza Company    Risk 1 (High)

[3992 rows x 2 columns]

In [250]:
hasTaco = chicagoDF['Name'].str.lower().str.startswith('taco')

In [251]:
chicagoDF[hasTaco]

                              Name           Risk
69                    TACOS NIETOS  Risk 1 (High)
199               TACO BELL #30408  Risk 1 (High)
292     TACO IN A BAG STORE 1, LLC  Risk 1 (High)
556            TACOS EL TIO 2 INC.  Risk 1 (High)
675               TACOS DON GABINO  Risk 1 (High)
...                            ...            ...
153138                   TACO BELL  Risk 1 (High)
153144                 TACO FRESCO  Risk 1 (High)
153331          TACO EL JALICIENSE  Risk 1 (High)
153548                  TACO CHINO  Risk 1 (High)
153728                  TACO CHINO  Risk 1 (High)

[718 rows x 2 columns]

In [252]:
endTaco = (chicagoDF['Name'].str.lower().str.endswith("tacos"))

In [253]:
chicagoDF[endTaco]

                   Name           Risk
382        LAZO'S TACOS  Risk 1 (High)
569        LAZO'S TACOS  Risk 1 (High)
2652       FLYING TACOS   Risk 3 (Low)
3250       JONY'S TACOS  Risk 1 (High)
3812       PACO'S TACOS  Risk 1 (High)
...                 ...            ...
151121      REYES TACOS  Risk 1 (High)
151318   EL MACHO TACOS  Risk 1 (High)
151801   EL MACHO TACOS  Risk 1 (High)
153087  RAYMOND'S TACOS  Risk 1 (High)
153504        MIS TACOS  Risk 1 (High)

[304 rows x 2 columns]

6.5. 문자열 분할

In [254]:
file2 = '../DATA/customers.csv'

In [255]:
cusDF = pd.read_csv(file2)

In [256]:
cusDF

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [257]:
phone_number = '555-123-4567'

In [258]:
phone_number.split('-')

['555', '123', '4567']

In [259]:
cusDF['Name'].str.split(" ").head()

0           [Frank, Manning]
1       [Elizabeth, Johnson]
2         [Donald, Stephens]
3    [Michael, Vincent, III]
4          [Jasmine, Zamora]
Name: Name, dtype: object

In [260]:
cusDF['Name'].str.split(" ").str.len().head()

0    2
1    2
2    2
3    3
4    2
Name: Name, dtype: int64

In [261]:
cusDF['Name'].str.split(pat = ' ', n =1).head()

0          [Frank, Manning]
1      [Elizabeth, Johnson]
2        [Donald, Stephens]
3    [Michael, Vincent III]
4         [Jasmine, Zamora]
Name: Name, dtype: object

In [262]:
cusDF['Name'].str.split(pat = ' ', n=1).str.get(0).head() #str.get(0) 각 행의 리스트에서 값을 가져올 수 있습니다.

0        Frank
1    Elizabeth
2       Donald
3      Michael
4      Jasmine
Name: Name, dtype: object

In [263]:
cusDF['Name'].str.split(pat = ' ', n=1).str.get(1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [264]:
cusDF['Name'].str.split(pat = ' ', n=1).str.get(-1).head()

0        Manning
1        Johnson
2       Stephens
3    Vincent III
4         Zamora
Name: Name, dtype: object

In [265]:
cusDF['Name'].str.split(pat = ' ', n=1, expand = True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [266]:
cusDF['Name'].str.split(pat = ' ', n=1, expand = True).head()

           0            1
0      Frank      Manning
1  Elizabeth      Johnson
2     Donald     Stephens
3    Michael  Vincent III
4    Jasmine       Zamora

In [268]:
cusDF[["First Name", "Last Name"]] = cusDF["Name"].str.split(pat = " ", n =1, expand = True)

In [269]:
cusDF

,Name,Address,First Name,Last Name
0,Frank Manning,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,Elizabeth Johnson,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,Donald Stephens,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,Michael Vincent III,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,Jasmine Zamora,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...,...
9956,Dana Browning,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,Amanda Anderson,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,Eric Davis,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,Taylor Hernandez,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,Sherry Nicholson,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson

In [270]:
cusDF=cusDF.drop(labels ='Name', axis ='columns')

In [271]:
cusDF

,Address,First Name,Last Name
0,"6461 Quinn Groves, East Matthew, New Hampshire...",Frank,Manning
1,"1360 Tracey Ports Apt. 419, Kyleport, Vermont,...",Elizabeth,Johnson
2,"19120 Fleming Manors, Prestonstad, Montana, 23495",Donald,Stephens
3,"441 Olivia Creek, Jimmymouth, Georgia, 82991",Michael,Vincent III
4,"4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...",Jasmine,Zamora
...,...,...,...
9956,"762 Andrew Views Apt. 254, North Paul, New Mex...",Dana,Browning
9957,"44188 Day Crest Apt. 901, Lake Marcia, Maine, ...",Amanda,Anderson
9958,"73015 Michelle Squares, Watsonville, West Virg...",Eric,Davis
9959,"129 Keith Greens, Haleyfurt, Oklahoma, 98916",Taylor,Hernandez
9960,"355 Griffin Valley, Davidtown, New Mexico, 17581",Sherry,Nicholson